/*
написать программу квадрата числа

4
-3
-7
*/



Console.WriteLine("введите число:");
int number = Convert.ToInt32(Console.ReadLine());

int result = number * number;
Console.WriteLine(result);